cookbook-backend/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "description") VALUES (?, ?)  [["name", "Test"], ["description", "Test"]]
---
  def create
    @recipe=Recipe.create(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @recipe=Recipe.find(params[:id]).destroy